In [ ]:
1.Series
2.Dataframe

In [ ]:
pip install pandas  #in command prompt or anaconda
!pip install pandas  #jupyter

In [1]:
import pandas as pd

In [2]:
print(pd.__version__)

1.0.5

## Series

In [8]:
list=[1,2,3,4,5]
label=['a','b','c','d','e']

In [9]:
list

[1, 2, 3, 4, 5]

In [10]:
type(list)

list

In [12]:
ser=pd.Series(list,index=label)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
Difference bw series and numpy array

>500k performance of pandas is better
<Numpy array are used

In [13]:
Marks={"maths":43,"Science":80,"physics":46,"chemistry":95}
Ser=pd.Series(Marks)

In [14]:
Ser

maths        43
Science      80
physics      46
chemistry    95
dtype: int64

In [15]:
Ser=pd.Series(Marks,index=["maths","Science","physics"])

In [16]:
Ser

maths      43
Science    80
physics    46
dtype: int64

### Series Indexing

In [17]:
Ser

maths      43
Science    80
physics    46
dtype: int64

In [18]:
Ser[1]

80

In [19]:
Ser["Science"]

80

### Slicing

In [21]:
Ser[1:3]

Science    80
physics    46
dtype: int64

In [22]:
Ser[1:]

Science    80
physics    46
dtype: int64

In [23]:
Ser

maths      43
Science    80
physics    46
dtype: int64

In [24]:
Ser.shape

(3,)

In [25]:
type(Ser)

pandas.core.series.Series

## Dataframe

In [32]:
list=[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]

columns=["a","b","c","d"]
labels=["A","B","C","D"]
df=pd.DataFrame(list,index=labels,columns=columns)

In [33]:
df

    a   b   c   d
A   1   2   3   4
B   5   6   7   8
C   9  10  11  12
D  13  14  15  16

In [54]:
df=pd.DataFrame({"Name":["vishwa","Saanvi","chetan","priya"],"Age":[2,5,10,15],"Branch":["AI","ML","ECE","EEE"]})

In [55]:
df

     Name  Age Branch
0  vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [56]:
type(df)

pandas.core.frame.DataFrame

In [57]:
df.shape

(4, 3)

In [58]:
df.columns

Index(['Name', 'Age', 'Branch'], dtype='object')

In [59]:
df1=df.rename(columns={"Name":"Name_new"})
df1

  Name_new  Age Branch
0   vishwa    2     AI
1   Saanvi    5     ML
2   chetan   10    ECE
3    priya   15    EEE

In [60]:
df

     Name  Age Branch
0  vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [61]:
df.columns[[0,1]]

Index(['Name', 'Age'], dtype='object')

In [62]:
df.columns.values

array(['Name', 'Age', 'Branch'], dtype=object)

In [69]:
df=pd.DataFrame({"Name":["vishwa","Saanvi","chetan","priya"],"Age":[2,5,10,15],"Branch":["AI","ML","ECE","EEE"]})

In [70]:
df

     Name  Age Branch
0  vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [71]:
df.drop("Name",axis=1,inplace=True)

In [72]:
df

   Age Branch
0    2     AI
1    5     ML
2   10    ECE
3   15    EEE

In [67]:
df["place"]=["hyd","vellore","chennai","ap"]

In [68]:
df

   Age  New_Branch    place
0    2         NaN      hyd
1    5         NaN  vellore
2   10         NaN  chennai
3   15         NaN       ap

In [73]:
df=pd.DataFrame({"Name":["vishwa","Saanvi","chetan","priya"],"Age":[2,5,10,15],"Branch":["AI","ML","ECE","EEE"]})

In [75]:
df1=pd.DataFrame({"Name":["a","b","c","d"],"Age":[2,5,10,15],"Branch":["AI","ML","ECE","EEE"],"Place":["hyd","vellore","chennai","ap"]})

In [76]:
df

     Name  Age Branch
0  vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [77]:
df1

  Name  Age Branch    Place
0    a    2     AI      hyd
1    b    5     ML  vellore
2    c   10    ECE  chennai
3    d   15    EEE       ap

In [79]:
df3=df.append(df1)

In [80]:
df3

     Name  Age Branch    Place
0  vishwa    2     AI      NaN
1  Saanvi    5     ML      NaN
2  chetan   10    ECE      NaN
3   priya   15    EEE      NaN
0       a    2     AI      hyd
1       b    5     ML  vellore
2       c   10    ECE  chennai
3       d   15    EEE       ap

In [81]:

df2 = pd.concat([df,df1])

In [82]:
df2

     Name  Age Branch    Place
0  vishwa    2     AI      NaN
1  Saanvi    5     ML      NaN
2  chetan   10    ECE      NaN
3   priya   15    EEE      NaN
0       a    2     AI      hyd
1       b    5     ML  vellore
2       c   10    ECE  chennai
3       d   15    EEE       ap

In [83]:
df3=df.append(df1,ignore_index="True")

In [84]:
df3

     Name  Age Branch    Place
0  vishwa    2     AI      NaN
1  Saanvi    5     ML      NaN
2  chetan   10    ECE      NaN
3   priya   15    EEE      NaN
4       a    2     AI      hyd
5       b    5     ML  vellore
6       c   10    ECE  chennai
7       d   15    EEE       ap

## Handle Missing values

In [ ]:
1.delete the
   row
    column
2.imputing the Values

In [ ]:
10000    50 records null values----delete row
        5000 records null----???  -----imputing
    70-80 percent is null in particular column----delete column

In [87]:
import numpy as np
df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [89]:
df1.isnull()

    Name  score1  score2
0  False   False    True
1   True   False   False
2  False    True   False
3   True    True    True
4  False   False   False
5  False   False   False

In [90]:
df1.isnull().any()

Name      True
score1    True
score2    True
dtype: bool

In [91]:
df1.isnull().sum()

Name      2
score1    2
score2    2
dtype: int64

In [94]:
#1.deleting the rows containing null values
df1.dropna(inplace=True)

In [95]:
df1

     Name  score1  score2
4  saanvi     4.0     4.0
5  saanvi     5.0     5.0

In [96]:
import numpy as np
df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [97]:
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [98]:
#delete the columns
df1.dropna(axis=1,inplace=True)

In [99]:
df1

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5]

In [ ]:
#Imputing the values
1 2 3 4 5 5
Mean 1+2+3+4+5+5/6
Median--3+4/2
Mode---5

In [130]:

df1=pd.DataFrame({'Name':['tulasi',np.nan,'supriya',np.nan,'saanvi','saanvi'],'score1':[5,4,np.nan,np.nan,4,5],'score2':[np.nan,5,9,np.nan,4,5]})
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     NaN     9.0
3      NaN     NaN     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [131]:
df1["score1"].mean()

4.5

In [132]:
df1["score1"]=df1["score1"].fillna(df1["score1"].mean())

In [133]:
df1

      Name  score1  score2
0   tulasi     5.0     NaN
1      NaN     4.0     5.0
2  supriya     4.5     9.0
3      NaN     4.5     NaN
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [134]:
df1["score2"].median()

5.0

In [135]:
df1["score2"]=df1["score2"].fillna(df1["score2"].median())

In [136]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1      NaN     4.0     5.0
2  supriya     4.5     9.0
3      NaN     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [ ]:
tulasi,tulasi,tulasi,saanvi,saanvi,saanvi,supriya

mode saanvi

0 saanvi
1 tulasi

mode[0]=sannvi
mode[1]=tulasi

In [137]:
df1["Name"].mode()

0    saanvi
dtype: object

In [138]:
df1["Name"]=df1["Name"].fillna(df1["Name"].mode()[0])

In [139]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [140]:
df1.Name.value_counts()

saanvi     4
tulasi     1
supriya    1
Name: Name, dtype: int64

In [141]:
group=df1.groupby("Name")

In [142]:
group

In [143]:
group.mean()

         score1  score2
Name
saanvi    4.375    4.75
supriya   4.500    9.00
tulasi    5.000    5.00

In [144]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [145]:
df1.shape

(6, 3)

In [146]:
df1.head(2)

     Name  score1  score2
0  tulasi     5.0     5.0
1  saanvi     4.0     5.0

In [147]:
df1.tail(3)

     Name  score1  score2
3  saanvi     4.5     5.0
4  saanvi     4.0     4.0
5  saanvi     5.0     5.0

In [148]:
Accessing the rows and columns

SyntaxError: invalid syntax (<ipython-input-148-0a020495fd5b>, line 1)

In [149]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [ ]:
loc
iloc

In [150]:
df1

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0
3   saanvi     4.5     5.0
4   saanvi     4.0     4.0
5   saanvi     5.0     5.0

In [151]:
df2=df1.loc[0]

In [152]:
df2

Name      tulasi
score1         5
score2         5
Name: 0, dtype: object

In [153]:
type(df2)

pandas.core.series.Series

In [154]:
type(df1)

pandas.core.frame.DataFrame

In [157]:
df1.loc[0:2]

      Name  score1  score2
0   tulasi     5.0     5.0
1   saanvi     4.0     5.0
2  supriya     4.5     9.0

In [1]:
data={
    "calories":[420,125,154],
    "duration":[50,40,45]
}

In [2]:
data

{'calories': [420, 125, 154], 'duration': [50, 40, 45]}

In [4]:
import pandas as pd

In [5]:
df=pd.DataFrame(data,index=["day1","day2","day3"])

In [6]:
df

      calories  duration
day1       420        50
day2       125        40
day3       154        45

In [8]:
df.loc["day2"]

calories    125
duration     40
Name: day2, dtype: int64

In [ ]:
loc----labelled indexs
iloc---integer based indexes

In [9]:
df=pd.DataFrame({"Name":["vishwa","Saanvi","chetan","priya"],"Age":[2,5,10,15],"Branch":["AI","ML","ECE","EEE"]})

In [10]:
df

     Name  Age Branch
0  vishwa    2     AI
1  Saanvi    5     ML
2  chetan   10    ECE
3   priya   15    EEE

In [12]:
df.iloc[1:3,0:2]

     Name  Age
1  Saanvi    5
2  chetan   10

In [13]:
df.iloc[2:,1:3]

   Age Branch
2   10    ECE
3   15    EEE

In [15]:
df.iloc[3:,0:1]

    Name
3  priya

In [16]:
df.iloc[3:,:1]

    Name
3  priya

In [20]:
df.loc[:,["Name","Branch"]]

     Name Branch
0  vishwa     AI
1  Saanvi     ML
2  chetan    ECE
3   priya    EEE